[
  {
    "id": 1,
    "name": "Erik Schwartz",
    "designation": "President",
    "details": "Erik is an industry veteran, committed to creating a mutual benefit for Hirelytics employees, consultants, and client partners.\n\nIn 2003, he started his professional career with a boutique staffing firm that expanded globally, eventually entering the public markets.\n\nErik held a variety of roles within its subsidiaries; starting as an entry level contributor and later transitioning into sales, operational, and executive management.\n\nWith an emphasis on delivering customer solutions, he was responsible for client acquisition/retention as the organization scaled core business revenues 4x from 2007-2014, before transitioning to executive management.\n\nHe led the Management Buyout of Hirelytics, Inc., in June of 2018, with the goal of leveraging Technology and Data Analytics to better understand the modern talent landscape.\n\nHis core competencies include post-acquisition integration, establishing specialty service offerings, and designing talent engagement/workforce solutions.\n\nLeading from the front, Erik manages our ecosystem as a collaborative learning environment, committed to meeting the expectations of a people-centric modern workplace, and he envisions Hirelytics as a “lifestyle business” for all its employees.\n\nErik considers himself a mentor first, and an entrepreneur second, while operating in the business of Staffing.\n\nHe holds a BA from Ithaca College and maintains numerous memberships in Technology, Staffing and Philanthropic organizations.\n\nHe is a fitness enthusiast, golfer, reader, a passionate learner, and you can find him relaxing on his boat in Charlestown during the summer.",
    "priority": 1,
    "image": {
      "source": "asset",
      "url": "assets/team/New-Project-131.png"
    },
    "socials": [
      {
        "name": "fb",
        "url": "https://www.facebook.com/erik.schwartz.7505"
      },
      {
        "name": "x",
        "url": ""
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/erik-schwartz-b65a603/"
      }
    ]
  },
  {
    "id": 2,
    "name": "Brianna Marin",
    "designation": "Chief Operating Officer",
    "details": "Brianna joined Hirelytics upon graduation from Northeastern University.  Her roles have always required her to wear many hats, as she does in her position here at Hirelytics.\n\nNotably, Brianna has achieved her SHRM-CP certification from the Society for Human Resource Management. This showcases her commitment to staying updated in industry best practices and her dedication to personal and professional growth.\n\nIt is Brianna’s unwavering dedication to continuous improvement that truly sets her apart. Her commitment to excellence aligns perfectly with our values at Hirelytics, as we strive to deliver exceptional services to our clients.",
    "image": {
      "source": "asset",
      "url": "assets/team/New-Project-141.png"
    },
    "priority": 2,
    "socials": [
      {
        "name": "fb",
        "url": ""
      },
      {
        "name": "x",
        "url": ""
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/briannajmarin"
      }
    ]
  },
  {
    "id": 3,
    "name": "Abraham Roman",
    "designation": "Solutions Specialist",
    "details": "Coming from a recruiting management background, leading operations for sourcing, screening, and hiring top talent in the IT and cloud technology domain. Working with a diverse and dynamic team of recruiters, sales representatives, and managers to deliver quality candidates and services to their clients across various industries and regions.\n\nAbraham has a strong background in sales development, marketing, and recruiting, and studied Air Traffic Controller at (ASCA) Superior Academy of Aeronautical Sciences. He has acquired multiple certifications in sales closing strategies and niche recruiting from reputable organizations such as LinkedIn, HRCI, and SHRM. He has leveraged his skills in recruiting at various levels, sales management, teamwork, customer service, and communication to influence outcomes and build positive and productive relationships with all stakeholders. He is enthusiastic about finding the best fit for both candidates and clients and strives to demonstrate who he is and what he transpires with his actions and hard work. With a passion for music, especially classical music with the violin, you will find Abraham doing community service, playing tennis or church work with the youth program.",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-6.jpg"
    },
    "priority": 3,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/abraham-roman-13830520b/"
      }
    ]
  },
  {
    "id": 4,
    "name": "Arleny Dela Cruz",
    "designation": "Solutions Specialist",
    "details": "Arleny joined the Hirelytics team with over 14 years of experience in human resources and tech recruitment, holding certifications in HR administration (UNICDA), tech recruitment (Devskiller), and digital marketing & e-commerce (Google). She specializes in solving recruitment challenges by combining strategic hiring practices with digital marketing to attract top talent and enhance employer branding. Arleny brings a global perspective from her experience in both in-house and agency recruitment. Outside work, she enjoys creating digital content, learning new skills, and spending time with animals—especially her beloved pets!\n",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-2.jpg"
    },
    "priority": 4,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/arlenydelacruzrod/?locale=en_US"
      }
    ]
  },
  {
    "id": 5,
    "name": "Harish Veeramani",
    "designation": "Solutions Specialist",
    "details": "Harish is an experienced professional with a strong background in IT recruitment and Talent Management. With extensive experience across the IT, Financial, Healthcare, and FinTech sectors, he has developed a deep understanding of the unique needs of various industries. His expertise lies in strategic recruiting, candidate sourcing, leadership management, and client handling, allowing him to connect top talent with the right opportunities.\n\nHarish holds a Bachelor’s degree in Computer Science and Engineering from Anna University. He currently lives with his wife and their newborn daughter, embracing the joys and challenges of parenthood. Passionate about people engagement and connecting with diverse individuals, Harish thrives in building relationships and fostering professional growth. \n\nOutside of work, Harish has a variety of hobbies that keep him active and engaged. He loves dancing and enjoys listening to music across different genres. A big fan of staying fit, he practices traditional martial arts, embracing both its physical and mental discipline. He is fluent in two languages and enjoys engaging with people from all walks of life.\n\n",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-8.jpg"
    },
    "priority": 5,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/harish-v-666358214"
      }
    ]
  },
  {
    "id": 6,
    "name": "Jose Reynoso",
    "designation": "Solutions Specialist",
    "details": "Jose graduated with a Law degree in 2020, beginning his career as a paralegal in law firms before transitioning to recruitment. While serving as Legal and HR Head at a private company, he discovered his passion for connecting talent with opportunities. Since then, he has built a strong career in staffing, holding roles at Jabil, a global manufacturing leader, and Hire Horatio, a BPO, where he sourced diverse talent across Operations, IT, and specialized roles, including managerial and international positions.\n\nJosé embraces creativity in both his personal and professional life. Outside of work, he enjoys exploring gastronomy and mixology and has worked as a bartender in one of London’s busiest pubs. He also has a flair for the arts—you might even spot him in a music video or short film while scrolling through YouTube.\n\nCombining an analytical mindset with a creative approach, José sees the value in people beyond the surface. With empathy and a positive attitude, he brings connection and energy to every opportunity he encounters.",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-4.jpg"
    },
    "priority": 6,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jos%C3%A9-g-reynoso-dur%C3%A1n/"
      }
    ]
  },
  {
    "id": 7,
    "name": "Juliana Estevez-Breton",
    "designation": "Solutions Specialis",
    "details": "Juliana joined the Hirelytics team with over 8 years of Technical Recruiting and Human Resources Management experience. While she has not worked in staffing before, she is used to the start-up environment, which includes doing a bit of everything.\n\nJuliana studied abroad to understand other cultures. Her favorite thing to do is to enjoy time with her babies (puppies) and her family. Fun fact, she enjoys the technical side so much that started to study Python!\n",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-3.jpg"
    },
    "priority": 7,
    "socials": [
      {
        "name": "linkedin",
        "url": "http://www.linkedin.com/in/julianaestevez-breton"
      }
    ]
  },
  {
    "id": 8,
    "name": "Praveen Mugunthan",
    "designation": "Solutions Specialist",
    "details": "Praveen joined the recruiting industry after earning his Bachelor’s degree in Computer Science from Bharathidasan University. Driven by his passion for connecting talented professionals with the right opportunities, he joined the Hirelytics team to elevate his recruiting expertise and broaden his impact in the industry. With over five years of experience in IT and non-IT recruitment, he has developed expertise in full-cycle recruiting, candidate sourcing, and employee onboarding. Known for his versatility, Praveen excels in navigating complex hiring processes, including tax terms, visa types, and compliance screenings.\n\nPraveen enjoys exploring creative solutions to challenges and mentoring team members. In his free time, he stays updated on industry trends, current market conditions, and company stock growth. He also values spending quality time with his wife and mother, enjoying weekend movies and TV shows together.\n",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-5.jpg"
    },
    "priority": 8,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/praveen-muhunthan-093b59105"
      }
    ]
  },
  {
    "id": 9,
    "name": "Silvestre Ortiz",
    "designation": "Solutions Specialist",
    "details": "Silvestre came on board at Hirelytics a year after earning his Master’s from Unisport Management School. With experience in sales and various HR areas, he’s now putting his skills to work as a Solution Specialist. Originally from the Dominican Republic and the youngest of a big family. Outside of work, you’ll probably find him tuning into music or watching a football (soccer) or baseball game.",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-7.jpg"
    },
    "priority": 9,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/silvestre-ortiz-0282a620b/"
      }
    ]
  },
  {
    "id": 10,
    "name": "Vanessa Higuera",
    "designation": "Solutions Specialist",
    "details": "Vanessa brings over 8 years of experience in human resources and technical recruiting to Hirelytics . She has always been passionate about connecting talent with opportunities and fostering growth and collaboration.\n\nOutside of work, Vanessa enjoys quality time with her husband and daughter, exploring new cultures, and diving into a good book—or learning something new. A lifelong traveler at heart, she dreams of visiting every corner of the globe. Vanessa is writing a book, though she claims she might never let anyone read it.",
    "image": {
      "source": "asset",
      "url": "assets/team/team-member-1.jpg"
    },
    "priority": 10,
    "socials": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/vanessa-higuera-b-b2390420a/"
      }
    ]
  }
]